1. Базовые вычисления (стр. 1, задача 1)

**Условие:** Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.

**Решение:**
```cpp
#include <iostream>
#include <cmath>

int main() {
    double a, b;
    std::cin >> a >> b;
    double c = std::sqrt(a * a + b * b);
    std::cout << c;
    return 0;
}
```

---

## 2. Условный оператор (стр. 2, задача 1)

**Условие:** Выведите наибольшее из трёх заданных чисел (программа должна вывести ровно одно целое число).

**Решение:**
```cpp
#include <iostream>

int main() {
    int a, b, c;
    std::cin >> a >> b >> c;
    int max = a;
    if (b > max) max = b;
    if (c > max) max = c;
    std::cout << max;
    return 0;
}
```

---

## 3. Циклы (стр. 3, задача 1)

**Условие:** Выведите (через пробел) все четные числа от a до b (включительно).

**Решение:**
```cpp
#include <iostream>

int main() {
    int a, b;
    std::cin >> a >> b;
    // Начинаем с ближайшего чётного, не меньшего a
    int start = a % 2 == 0 ? a : a + 1;
    for (int i = start; i <= b; i += 2) {
        std::cout << i << " ";
    }
    return 0;
}
```

---

## 4. Массивы (стр. 4, задача 1)

**Условие:** Дан массив, состоящий из целых чисел. Напишите программу, которая выводит те элементы массива, которые являются чётными числами.

**Решение:**
```cpp
#include <iostream>
#include <vector>

int main() {
    int n;
    std::cin >> n;
    std::vector<int> arr(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> arr[i];
    }
    for (int x : arr) {
        if (x % 2 == 0) {
            std::cout << x << " ";
        }
    }
    return 0;
}
```

---

## 5. Строки (стр. 5, задача 1)

**Условие:** Измените регистр символа, если он был латинской буквой: сделайте его заглавным, если он был строчной буквой и наоборот.

**Решение:**
```cpp
#include <iostream>

int main() {
    char ch;
    std::cin >> ch;
    
    if (ch >= 'a' && ch <= 'z') {
        ch = ch - 'a' + 'A';
    } else if (ch >= 'A' && ch <= 'Z') {
        ch = ch - 'A' + 'a';
    }
    
    std::cout << ch;
    return 0;
} 
```
---

## 6. Структуры (стр. 6, задача 1)

**Условие:** Выведите координаты наиболее удаленной от начала координат точки.  
Создайте структуру `Point` и сохраните исходные данные в массиве структур.

**Решение:**
```cpp
#include <iostream>
#include <vector>
#include <cmath>

struct Point {
    int x, y;
    double distance() const {
        return std::sqrt(x * x + y * y);
    }
};

int main() {
    int n;
    std::cin >> n;
    std::vector<Point> points(n);
    for (int i = 0; i < n; ++i) {
        std::cin >> points[i].x >> points[i].y;
    }
    // Поиск точки с максимальным расстоянием
    double maxDist = -1.0;
    Point farthest = {0, 0};
    for (const auto& p : points) {
        double d = p.distance();
        if (d > maxDist) {
            maxDist = d;
            farthest = p;
        }
    }
    std::cout << farthest.x << " " << farthest.y;
    return 0;
}
```

---

## 7. Функции (стр. 8, задача 1)

**Условие:** Напишите функцию `int min(int a, int b, int c, int d)`, находящую наименьшее из четырех данных чисел.

**Решение:**
```cpp
#include <iostream>

int min(int a, int b, int c, int d) {
    int m1 = (a < b) ? a : b;
    int m2 = (c < d) ? c : d;
    return (m1 < m2) ? m1 : m2;
}

int main() {
    int a, b, c, d;
    std::cin >> a >> b >> c >> d;
    std::cout << min(a, b, c, d);
    return 0;
}
```

---

## 8. Динамические структуры данных – Очередь (стр. 11, задача 1)

**Условие:** Реализуйте структуру данных «очередь».  
Программа читает последовательность команд и выполняет их. Команды:  
`push n` – добавить число n, вывести `ok`.  
`pop` – удалить первый элемент, вывести его.  
`front` – вывести первый элемент, не удаляя.  
`size` – вывести количество элементов.  
`clear` – очистить очередь, вывести `ok`.  
`exit` – вывести `bye` и завершить работу.  
Гарантируется, что все операции корректны.

**Решение (с использованием массива – циклическая очередь):**
```cpp
#include <iostream>
#include <string>

const int MAX_SIZE = 101; // максимальный размер очереди

int main() {
    int queue[MAX_SIZE];
    int head = 0, tail = 0;
    std::string cmd;

    while (std::cin >> cmd) {
        if (cmd == "push") {
            int n;
            std::cin >> n;
            queue[tail] = n;
            tail = (tail + 1) % MAX_SIZE;
            std::cout << "ok\n";
        }
        else if (cmd == "pop") {
            std::cout << queue[head] << "\n";
            head = (head + 1) % MAX_SIZE;
        }
        else if (cmd == "front") {
            std::cout << queue[head] << "\n";
        }
        else if (cmd == "size") {
            int size = (tail - head + MAX_SIZE) % MAX_SIZE;
            std::cout << size << "\n";
        }
        else if (cmd == "clear") {
            head = tail = 0;
            std::cout << "ok\n";
        }
        else if (cmd == "exit") {
            std::cout << "bye\n";
            break;
        }
    }
    return 0;
}
```

[Хэндбук С++](https://education.yandex.ru/handbook/cpp?ysclid=mljbmifpyh772360477)
[Документация Microsoft Learn](https://learn.microsoft.com/ru-ru/cpp/cpp/?view=msvc-170)
